---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.ClearValues
source: html/7d9ea288-d929-5c5d-aafc-756901eae87f.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.ClearValues Method

Clears all the values stored for this demand factor definition.

## Syntax (C#)
```csharp
public void ClearValues()
```